emlynmac/squeezelite-esp32/components/squeezelite/output_i2s.c
	// activate headset
	adac->headset(inserted);
	
	// and chain if any
	if (jack_handler_chain) (jack_handler_chain)(inserted);
}

/****************************************************************************************
 * amp GPIO
 */
#ifndef AMP_LOCKED 
static void set_amp_gpio(int gpio, char *value) {
	char *p;
	
	if (strcasestr(value, "amp")) {
		amp_control.gpio = gpio;
		if ((p = strchr(value, ':')) != NULL) amp_control.active = atoi(p + 1);
	}	
}	
#endif

/****************************************************************************************
 * I2S API wrapper functions for ESP-IDF 4.x / 5.x compatibility
 */
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)

typedef struct {
	int bck_io_num;
	int ws_io_num;
	int data_out_num;
	int data_in_num;
	int mck_io_num;
} i2s_pin_config_compat_t;

static esp_err_t i2s_driver_install_compat(const i2s_config_compat_t *config, i2s_pin_config_compat_t *pin_config) {
	if (i2s_tx_handle != NULL) {
		return ESP_ERR_INVALID_STATE;
	}

	// Configure channel
	i2s_chan_config_t chan_cfg = I2S_CHANNEL_DEFAULT_CONFIG(CONFIG_I2S_NUM, I2S_ROLE_MASTER);
	chan_cfg.dma_desc_num = config->dma_buf_count;
	chan_cfg.dma_frame_num = config->dma_buf_len;
	chan_cfg.auto_clear = config->tx_desc_auto_clear;

	esp_err_t ret = i2s_new_channel(&chan_cfg, &i2s_tx_handle, NULL);
	if (ret != ESP_OK) {
		return ret;
	}

	// Configure standard mode
	i2s_std_config_t std_cfg = {
		.clk_cfg = {
			.sample_rate_hz = config->sample_rate,
			.clk_src = config->use_apll ? I2S_CLK_SRC_APLL : I2S_CLK_SRC_DEFAULT,
			.mclk_multiple = I2S_MCLK_MULTIPLE_256,  // Default, may need adjustment
		},
		.slot_cfg = I2S_STD_PHILIPS_SLOT_DEFAULT_CONFIG(config->bits_per_sample, config->channel_format),
		.gpio_cfg = {
			.mclk = pin_config->mck_io_num,
			.bclk = pin_config->bck_io_num,
			.ws = pin_config->ws_io_num,
			.dout = pin_config->data_out_num,
			.din = pin_config->data_in_num,
			.invert_flags = {
				.mclk_inv = false,
				.bclk_inv = false,
				.ws_inv = false,
			},
		},
	};

	// Handle fixed_mclk if specified
	if (config->fixed_mclk > 0 && config->use_apll) {
		// Calculate mclk_multiple from fixed_mclk
		// fixed_mclk = sample_rate * mclk_multiple
		uint32_t calculated_multiple = config->fixed_mclk / config->sample_rate;
		// Find closest standard multiple
		if (calculated_multiple <= 128) {
			std_cfg.clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_128;
		} else if (calculated_multiple <= 192) {
			std_cfg.clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_192;
		} else if (calculated_multiple <= 256) {
			std_cfg.clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_256;
		} else if (calculated_multiple <= 384) {
			std_cfg.clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_384;
		} else {
			std_cfg.clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_512;
		}
	}

	ret = i2s_channel_init_std_mode(i2s_tx_handle, &std_cfg);
	if (ret != ESP_OK) {
		i2s_del_channel(i2s_tx_handle);
		i2s_tx_handle = NULL;
		return ret;
	}

	ret = i2s_channel_enable(i2s_tx_handle);
	if (ret != ESP_OK) {
		i2s_del_channel(i2s_tx_handle);
		i2s_tx_handle = NULL;
		return ret;
	}

	return ESP_OK;
}

static esp_err_t i2s_driver_uninstall_compat(void) {
	if (i2s_tx_handle == NULL) {
		return ESP_ERR_INVALID_STATE;
	}

	i2s_channel_disable(i2s_tx_handle);
	esp_err_t ret = i2s_del_channel(i2s_tx_handle);
	i2s_tx_handle = NULL;
	return ret;
}

static esp_err_t i2s_write_compat(const void *src, size_t size, size_t *bytes_written, TickType_t ticks_to_wait) {
	if (i2s_tx_handle == NULL) {
		return ESP_ERR_INVALID_STATE;
	}
	return i2s_channel_write(i2s_tx_handle, src, size, bytes_written, ticks_to_wait);
}

static esp_err_t i2s_zero_dma_buffer_compat(void) {
	if (i2s_tx_handle == NULL) {
		return ESP_ERR_INVALID_STATE;
	}
	// In ESP-IDF 5.x, we can preload silence
	static uint8_t zero_buf[512] = {0};
	size_t bytes_written;
	// Write several zero buffers to fill DMA
	for (int i = 0; i < i2s_config.dma_buf_count; i++) {
		i2s_channel_write(i2s_tx_handle, zero_buf, sizeof(zero_buf), &bytes_written, 0);
	}
	return ESP_OK;
}

static esp_err_t i2s_set_sample_rates_compat(uint32_t rate) {
	if (i2s_tx_handle == NULL) {
		return ESP_ERR_INVALID_STATE;
	}

	i2s_config.sample_rate = rate;

	// Reconfigure clock
	i2s_std_clk_config_t clk_cfg = {
		.sample_rate_hz = rate,
		.clk_src = i2s_config.use_apll ? I2S_CLK_SRC_APLL : I2S_CLK_SRC_DEFAULT,
		.mclk_multiple = I2S_MCLK_MULTIPLE_256,
	};

	// Handle fixed_mclk
	if (i2s_config.fixed_mclk > 0 && i2s_config.use_apll) {
		uint32_t calculated_multiple = i2s_config.fixed_mclk / rate;
		if (calculated_multiple <= 128) {
			clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_128;
		} else if (calculated_multiple <= 192) {
			clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_192;
		} else if (calculated_multiple <= 256) {
			clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_256;
		} else if (calculated_multiple <= 384) {
			clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_384;
		} else {
			clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_512;
		}
	}

	return i2s_channel_reconfig_std_clock(i2s_tx_handle, &clk_cfg);
}

static esp_err_t i2s_stop_compat(void) {
	if (i2s_tx_handle == NULL) {
		return ESP_OK;
	}
	return i2s_channel_disable(i2s_tx_handle);
}

// i2s_write_expand compatibility wrapper
static esp_err_t i2s_write_expand_compat(const void *src, size_t size, size_t src_bits, size_t aim_bits,
										 size_t *bytes_written, TickType_t ticks_to_wait) {
	if (i2s_tx_handle == NULL) {
		return ESP_ERR_INVALID_STATE;
	}
	
	// For now, just use regular write - expansion should be handled by the I2S hardware
	// or we'd need to implement bit expansion in software
	// This is a simplified approach; full bit expansion would require buffer allocation
	return i2s_channel_write(i2s_tx_handle, src, size, bytes_written, ticks_to_wait);
}

// Macro definitions for compatibility
#define i2s_driver_install(port, config, queue_size, queue) i2s_driver_install_compat(config, &i2s_dac_pin)
#define i2s_driver_uninstall(port) i2s_driver_uninstall_compat()
#define i2s_write(port, src, size, bytes_written, timeout) i2s_write_compat(src, size, bytes_written, timeout)
#define i2s_write_expand(port, src, size, src_bits, aim_bits, bytes_written, timeout) i2s_write_expand_compat(src, size, src_bits, aim_bits, bytes_written, timeout)
#define i2s_zero_dma_buffer(port) i2s_zero_dma_buffer_compat()
#define i2s_set_sample_rates(port, rate) i2s_set_sample_rates_compat(rate)
#define i2s_stop(port) i2s_stop_compat()
#define i2s_set_pin(port, pin) ESP_OK  // Pin config handled in install

// Pin config compatibility type
#define i2s_pin_config_t i2s_pin_config_compat_t

