emlynmac/squeezelite-esp32/components/squeezelite/output_i2s.c
/* 
 SPDIF is supposed to be (before BMC encoding, from LSB to MSB)				
    0....  1...   191..  0
    BLFMRF MLFWRF MLFWRF BLFMRF (B,M,W=preamble-4, L/R=left/Right-24, F=Flags-4)
    each xLF pattern is 32 bits 
	PPPP AAAA  SSSS SSSS  SSSS SSSS  SSSS VUCP (P=preamble, A=auxiliary, S=sample-20bits, V=valid, U=user data, C=channel status, P=parity)
 After BMC encoding, each bit becomes 2 hence this becomes a 64 bits word. The parity
 is fixed by changing AAAA bits so that VUPC does not change. Then then trick is to 
 start not with a PPPP sequence but with an VUCP sequence to that the 16 bits samples
 are aligned with a BMC word boundary. Input buffer is left first => LRLR...
 The I2S interface must output first the B/M/W preamble which means that second
 32 bits words must be first and so must be marked right channel. 
*/
static void IRAM_ATTR spdif_convert(ISAMPLE_T *src, size_t frames, u32_t *dst) {
    static u8_t vu, count;    
	register u16_t hi, lo;
#if BYTES_PER_FRAME == 8
	register u16_t aux;
#endif
    
    // we assume frame == 0 as well...
    if (!src) {
        count = 0;
        vu = VUCP24[0];
    }
    
	while (frames--) {
		// start with left channel
#if BYTES_PER_FRAME == 4		
		hi = spdif_bmclookup[(u8_t)(*src >> 8)];
		lo = spdif_bmclookup[(u8_t)*src++];
		if (lo & 1) hi = ~hi;

        if (!count--) {            
			*dst++ = (vu << 24) | (PREAMBLE_B << 16) | 0xCCCC;
			count = 191;
		} else {
			*dst++ = (vu << 24) | (PREAMBLE_M << 16) | 0xCCCC;
		}
#else
		hi = spdif_bmclookup[(u8_t)(*src >> 24)];
		lo = spdif_bmclookup[(u8_t)(*src >> 16)];
		aux = spdif_bmclookup[(u8_t)(*src++ >> 8)];
		if (aux & 1) lo = ~lo;
		if (lo & 1) hi = ~hi;


        if (!count--) {
			*dst++ = (vu << 24) | (PREAMBLE_B << 16) | aux;
			count = 191;
		} else {
			*dst++ = (vu << 24) | (PREAMBLE_M << 16) | aux;
		}
#endif

        vu = VUCP24[hi & 1];
		*dst++ = ((u32_t)lo << 16) | hi;

		// then do right channel, no need to check PREAMBLE_B
#if BYTES_PER_FRAME == 4		
		hi = spdif_bmclookup[(u8_t)(*src >> 8)];
		lo = spdif_bmclookup[(u8_t)*src++];
		if (lo & 1) hi = ~hi;

		*dst++ = (vu << 24) | (PREAMBLE_W << 16) | 0xCCCC;
#else
		hi = spdif_bmclookup[(u8_t)(*src >> 24)];
		lo = spdif_bmclookup[(u8_t)(*src >> 16)];
		aux = spdif_bmclookup[(u8_t)(*src++ >> 8)];
		if (aux & 1) lo = ~lo;
		if (lo & 1) hi = ~hi;

		*dst++ = (vu << 24) | (PREAMBLE_W << 16) | aux;
#endif

        vu = VUCP24[hi & 1];
		*dst++ = ((u32_t)lo << 16) | hi;
	}
}
